[Psycho_LightTheFuse]
PlayerInjuredString=LIGHT THE FUSE!
InjuredTooltipString1=KILL ENEMY WITH DETONATION TO REVIVE
InjuredTooltipString2=HOLD <StringAliasMap:Action.Use> TO DETONATE NOW

[Psycho_PullThePin]
Notification=PULL THE PIN KILL!

[WillowGame.Default__CustomizationUsage_ExtraPlayerB CustomizationUsage_ExtraPlayerB]
CustomizationUsageName=Psycho

[CustomizationUsage_ExtraPlayerB]
CustomizationUsageName=Psycho